[{
  "_id": {
    "$oid": "63691e163e87752578a6aed9"
  },
  "posterId": "63691c653e87752578a6aec0",
  "message": "Women In Trucking Association Honors Stericycle for its Commitment to Advancing the Employment of Women in Trucking \r\n\r\nBANNOCKBURN, Ill., Nov. 7, 2022 /PRNewswire/ -- Stericycle, Inc. (Nasdaq: SRCL), a leading provider of regulated medical waste management, secure information destruction and patient engagement solutions, announced today it was honored as a \"Top Company for Women to Work for in Transportation\" for the second year in a row by the Women In Trucking Association. This annual award recognizes companies that exemplify a dedication to female employment and strive to create inclusive work environments for women in the trucking industry.",
  "image": "http://localhost:4200/images/Stericycle_Logo.jpg1667833366320.jpg",
  "likes": 9,
  "usersLiked": [
    "63691b4923590aa10d6594c3",
    "63691afe23590aa10d6594ac",
    "63691aac23590aa10d659495",
    "63690abe829407acb79b3f53",
    "63691bd123590aa10d6594da",
    "6369191216483a418bc47418",
    "63690defcc71c4d8feffc569",
    "636917338a1cfe09ed6567d1",
    "636918294c13a7994c9c5a8c"
  ],
  "comments": [
    {
      "commenterId": "63691b4923590aa10d6594c3",
      "text": "is doing well for his abilities. He seems to enjoy participating in class activities. It's a pleasure watching him work hard on the book work. He has demonstrated that he is able to learn new vocabulary quite quickly when he wants to. He is able to repeat my pronunciation of new words quite well.",
      "_id": {
        "$oid": "6369369d4d81eea3dc03056d"
      }
    },
    {
      "commenterId": "63691afe23590aa10d6594ac",
      "text": "As the action on college football fields throughout the country grows more intense, so do the steaming-hot takes of commentators, both professional and amateur.",
      "_id": {
        "$oid": "6369375e4d81eea3dc030594"
      }
    },
    {
      "commenterId": "63691b4923590aa10d6594c3",
      "text": "Stericycle has opened my eyes to the rules and regulations that go along with all aspects of a healthcare facility. It makes compliance so easy.\"",
      "_id": {
        "$oid": "63693b034d81eea3dc030653"
      }
    },
    {
      "commenterId": "63690abe829407acb79b3f53",
      "text": "It’s actually one of our core values—along with doing the right thing and being united. As an industry leader, we are committed to accelerating the diversity of our global workforce, ensuring everyone has an equitable opportunity to succeed.",
      "_id": {
        "$oid": "63693b8d4d81eea3dc0306bd"
      }
    },
    {
      "commenterId": "63690defcc71c4d8feffc569",
      "text": "Growth “can cost more than it’s worth,” he said, “and that’s the new era that we’re moving into, and we have to come to recognize that.”",
      "_id": {
        "$oid": "636a0ce2fb39baed9a5e7271"
      }
    },
    {
      "commenterId": "636918294c13a7994c9c5a8c",
      "text": "Stericycle Releases its 12th Annual Shred-it Data Protection Report",
      "_id": {
        "$oid": "636a0e99fb39baed9a5e7871"
      }
    },
    {
      "commenterId": "63691aac23590aa10d659495",
      "text": "Janet Zelenka Wins ORBIE Award",
      "_id": {
        "$oid": "636a0f50fb39baed9a5e7c53"
      }
    },
    {
      "commenterId": "63691b4923590aa10d6594c3",
      "text": "Stericycle Observes Hispanic Heritage Month",
      "_id": {
        "$oid": "636a1015fb39baed9a5e8098"
      }
    },
    {
      "commenterId": "63690abe829407acb79b3f53",
      "text": "Stericycle is dedicated to protecting the health and well-being of the people and places we serve in a safe, responsible, and sustainable way. By connecting people, knowledge, insights, and resources, we engage with our customers to help build healthier and safer communities.",
      "_id": {
        "$oid": "636a110bfb39baed9a5e8636"
      }
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1660921366322"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1667895563393"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "63691fbf4d81eea3dc030541"
  },
  "posterId": "63691bd123590aa10d6594da",
  "message": "CONSTELLATION BRANDS, INC.\r\n\r\nManaging partner Rudina Seseri, who founded Glasswing in 2016 with Rick Grinnell, said that’s intentional. She wanted to set Glasswing apart by hiring all of the roles that make up the C-suite at a technology company.\r\n\r\nOn Monday, Glasswing announced three new executive hires, bringing the team to 15 people. The idea is that by hiring successful entrepreneurs and seasoned executives, Glasswing can help its portfolio companies “in the earliest days, when they need the most help.”\r\n\r\nIt’s common for VC firms to have a network of industry experts, but Glasswing is hiring full-timers.",
  "image": "http://localhost:4200/images/AA13OViM.jpg1667833791535.jpg",
  "likes": 6,
  "usersLiked": [
    "63691b4923590aa10d6594c3",
    "63691aac23590aa10d659495",
    "63690abe829407acb79b3f53",
    "63691bd123590aa10d6594da",
    "63690e1fcc71c4d8feffc571",
    "6369191216483a418bc47418"
  ],
  "comments": [
    {
      "commenterId": "63690e1fcc71c4d8feffc571",
      "text": "Are you being paid fairly? Up to half of companies have pay parity across jobs within their firm, new research suggests.",
      "_id": {
        "$oid": "636a0d89fb39baed9a5e7411"
      }
    },
    {
      "commenterId": "6369191216483a418bc47418",
      "text": "This month, New York City became the latest place to mandate pay transparency. Eligible employers in the city have to put the maximum and minimum wage they are willing to pay in jobs, promotions and transfer opportunities.",
      "_id": {
        "$oid": "636a0ef6fb39baed9a5e79fe"
      }
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1663427391540"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1663402230607"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "6369203c4d81eea3dc03054e"
  },
  "posterId": "63691b4923590aa10d6594c3",
  "message": "Risk assets had rallied on Friday amid speculation China was preparing to relax its pandemic restrictions, but over the weekend health officials reiterated their commitment to the \"dynamic-clearing\" approach to COVID cases as soon as they emerge.\r\n\r\n\"Despite the denial, notions that China will pivot to living with COVID in the new year are unlikely to be quashed given the very real toll that zero-COVID is having on the economy,\" said Tapas Strickland, head of market economics at NAB.\r\n\r\n\"With China going into winter, most analysts think a change in zero-COVID is unlikely until at least March.\"",
  "image": "http://localhost:4200/images/AA13O4mZ.jpg1667833916959.jpg",
  "likes": 6,
  "usersLiked": [
    "63691b4923590aa10d6594c3",
    "63691afe23590aa10d6594ac",
    "63690abe829407acb79b3f53",
    "6369191216483a418bc47418",
    "63690e1fcc71c4d8feffc571",
    "636917338a1cfe09ed6567d1"
  ],
  "comments": [
    {
      "commenterId": "63691afe23590aa10d6594ac",
      "text": "What do the experts think of the matchup? Let's see how the College Football Power Index computer prediction model projects the game.",
      "_id": {
        "$oid": "6369374e4d81eea3dc03058c"
      }
    },
    {
      "commenterId": "63691b4923590aa10d6594c3",
      "text": "Architecture is expressed in this context by projects – organic farms, contemporary houses in landscapes needing protection, industrial “ecosystems” – that seek sustainability in technological solutions but above all in a new sensitivity to a context that is both natural and cultural.",
      "_id": {
        "$oid": "63693ac04d81eea3dc030644"
      }
    },
    {
      "commenterId": "636917338a1cfe09ed6567d1",
      "text": "Wage inequality",
      "_id": {
        "$oid": "636a0e08fb39baed9a5e760b"
      }
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1663945916960"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1663920393552"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "636937394d81eea3dc030581"
  },
  "posterId": "63691afe23590aa10d6594ac",
  "message": "A pair of Lone Star State rivals square off in a huge game as TCU travels to Texas in college football's Week 11 action on Saturday.\r\n\r\nTexas has won four of the last five overall with a 7-point loss to Oklahoma State the only loss, and the Longhorns are coming off an important win on the road against a ranked Kansas State team, moving into the No. 2 spot in the Big 12.\r\n\r\nTCU is the last undefeated team in the Big 12 and one of four nationally yet to lose, but have played close games in the first half against conference opposition.",
  "image": "http://localhost:4200/images/AAUWKJH.jpg1667839801964.jpg",
  "likes": 9,
  "usersLiked": [
    "63691afe23590aa10d6594ac",
    "63691aac23590aa10d659495",
    "63691b4923590aa10d6594c3",
    "63690abe829407acb79b3f53",
    "63690defcc71c4d8feffc569",
    "63690e1fcc71c4d8feffc571",
    "636917338a1cfe09ed6567d1",
    "63691bd123590aa10d6594da",
    "63691c653e87752578a6aec0"
  ],
  "comments": [
    {
      "commenterId": "63691b4923590aa10d6594c3",
      "text": "Rivalries are great for many reasons, one of which being that they help with fan engagement and the growth of fan bases, something Texas State is in desperate need of.",
      "_id": {
        "$oid": "63693b304d81eea3dc030661"
      }
    },
    {
      "commenterId": "63690abe829407acb79b3f53",
      "text": "Here are three of the best potential rivalries Texas State could develop and three rivals that are very unlikely, but that we would love to see happen.",
      "_id": {
        "$oid": "63693b5b4d81eea3dc03068e"
      }
    },
    {
      "commenterId": "63690defcc71c4d8feffc569",
      "text": "The game went on. The game always goes on. That was the lesson I learned as an 8-year-old. Nothing will ever stop the game.",
      "_id": {
        "$oid": "636a0cb8fb39baed9a5e7243"
      }
    },
    {
      "commenterId": "63690e1fcc71c4d8feffc571",
      "text": "“COME ON!” I would growl. “GET ‘IM!”",
      "_id": {
        "$oid": "636a0d5afb39baed9a5e73bb"
      }
    },
    {
      "commenterId": "636917338a1cfe09ed6567d1",
      "text": "It was third and goal, the game was tied, and Washington’s Robert Griffin III was running toward the end zone. ",
      "_id": {
        "$oid": "636a0dfefb39baed9a5e75e5"
      }
    },
    {
      "commenterId": "63691afe23590aa10d6594ac",
      "text": "Falcons got him. Linebacker Sean Weatherspoon lowered his shoulder and smashed Griffin’s head. ",
      "_id": {
        "$oid": "636a0fa0fb39baed9a5e7e74"
      }
    },
    {
      "commenterId": "63691b4923590aa10d6594c3",
      "text": "The NFL reached a $765 million concussion settlement with more than 4,500 former players and developed a new protocol to detect and treat concussions. The game went on.",
      "_id": {
        "$oid": "636a0ffcfb39baed9a5e8056"
      }
    },
    {
      "commenterId": "63691bd123590aa10d6594da",
      "text": "Even after that, I kept watching until early 2022, when I finally saw the Bulldogs win a championship. It seemed like a good time to walk away.",
      "_id": {
        "$oid": "636a1063fb39baed9a5e82d0"
      }
    },
    {
      "commenterId": "63691c653e87752578a6aec0",
      "text": "By now it was clear. No matter how much I missed football, football did not miss me.",
      "_id": {
        "$oid": "636a10c5fb39baed9a5e8521"
      }
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1664902201966"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1664871493806"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "636937b04d81eea3dc0305a4"
  },
  "posterId": "63691aac23590aa10d659495",
  "message": "Herman E. Daly, an economist who envisioned a new practice of his field, a discipline known as ecological economics in which growth is not an unquestioned good and the impact of commerce on the environment and society matters as much as the flow of money, died Oct. 28 at a hospital in Richmond. He was 84.",
  "image": "http://localhost:4200/images/AA13L4n1.jpg1667843633289.jpg",
  "likes": 9,
  "usersLiked": [
    "63691aac23590aa10d659495",
    "63691bd123590aa10d6594da",
    "63690defcc71c4d8feffc569",
    "63691c653e87752578a6aec0",
    "63691b4923590aa10d6594c3",
    "63690abe829407acb79b3f53",
    "636918294c13a7994c9c5a8c",
    "6369191216483a418bc47418",
    "63691afe23590aa10d6594ac"
  ],
  "comments": [
    {
      "commenterId": "63691bd123590aa10d6594da",
      "text": "His death was announced by the University of Maryland, where Dr. Daly was a professor in the School of Public Policy from 1994 to 2010 before taking emeritus status. The cause was a brain hemorrhage, said his daughter Karen Daly Junker.",
      "_id": {
        "$oid": "63693a384d81eea3dc0305d3"
      }
    },
    {
      "commenterId": "63690defcc71c4d8feffc569",
      "text": "Dr. Daly was widely regarded as a founder of ecological economics, a field that stood on the margins of economic study when he entered academia five decades ago but in recent years has attracted increasing notice around the world.",
      "_id": {
        "$oid": "63693a4d4d81eea3dc0305ed"
      }
    },
    {
      "commenterId": "63691c653e87752578a6aec0",
      "text": "Although it took years to catch on, Dr. Daly’s model has became increasingly influential in recent years.",
      "_id": {
        "$oid": "63693a764d81eea3dc03060b"
      }
    },
    {
      "commenterId": "63691b4923590aa10d6594c3",
      "text": "He saw the concept of “sustainable growth” as an oxymoron — more achievable, in his view, was “sustainable development” — and argued that measures such as gross domestic product were insufficient to quantify the direction of an economy.",
      "_id": {
        "$oid": "63693a9c4d81eea3dc03062d"
      }
    },
    {
      "commenterId": "63690defcc71c4d8feffc569",
      "text": "At the same time, the white settlers and their descendants dramatically altered the free-flowing rivers that were so important to the Karuk and other local tribes.",
      "_id": {
        "$oid": "636a0c96fb39baed9a5e722c"
      }
    },
    {
      "commenterId": "63690e1fcc71c4d8feffc571",
      "text": "His work was also deeply grounded in his Methodist faith, his daughter said, and his hope for the survival of what he saw as God’s creation.",
      "_id": {
        "$oid": "636a0d4ffb39baed9a5e739b"
      }
    },
    {
      "commenterId": "636918294c13a7994c9c5a8c",
      "text": "Dr. Daly taught economics for two decades at Louisiana State University, in addition to lecturing around the world. He was a senior economist at the World Bank from 1988 to 1994 before joining the University of Maryland.",
      "_id": {
        "$oid": "636a0e79fb39baed9a5e781c"
      }
    },
    {
      "commenterId": "6369191216483a418bc47418",
      "text": "Survivors include his wife of 59 years, the former Marcia Damasceno, of Midlothian, Va.; two daughters, Terri Daly Stewart of Suwanee, Ga., and Karen Daly Junker of North Chesterfield, Va.; a sister; and three grandchildren.",
      "_id": {
        "$oid": "636a0ee5fb39baed9a5e79a5"
      }
    },
    {
      "commenterId": "63691afe23590aa10d6594ac",
      "text": "My duty is to do the best I can and put out some ideas,” Dr. Daly told the New York Times earlier this year. “Whether the seed that I plant is going to grow is not up to me. It’s just up to me to plant it and water it.",
      "_id": {
        "$oid": "636a0f94fb39baed9a5e7e38"
      }
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1665593520692"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1665562388986"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "636a09befb39baed9a5e7074"
  },
  "posterId": "6369191216483a418bc47418",
  "message": "The native people of the Klamath River say it was yet another example of how the system is still disproportionately tilted toward the interests of white farmers. Efforts by Gov. Gavin Newsom and the Biden administration to prioritize tribal input in environmental policy and return natural resources that had been stolen haven’t moved fast enough for the tribes.\r\n\r\nThe Karuk believe the fate of the world is at stake.\r\n\r\nThe Klamath’s annual salmon runs aren’t just about food for the tribe, though that’s part of why a handful of tribal fishermen risk their lives on those slippery rocks using more or less the same gear and techniques that their ancestors used for centuries.",
  "image": "http://localhost:4200/images/AA13NKt6.jpg1667893694861.jpg",
  "likes": 6,
  "usersLiked": [
    "6369191216483a418bc47418",
    "63690defcc71c4d8feffc569",
    "63690e1fcc71c4d8feffc571",
    "636917338a1cfe09ed6567d1",
    "63691aac23590aa10d659495",
    "63691b4923590aa10d6594c3"
  ],
  "comments": [
    {
      "commenterId": "63690defcc71c4d8feffc569",
      "text": "And what Reed’s seen these past few years has him worried that the apocalypse is nearly here.",
      "_id": {
        "$oid": "636a0c85fb39baed9a5e7202"
      }
    },
    {
      "commenterId": "63690e1fcc71c4d8feffc571",
      "text": "But when the salmon don’t show up, it’s hard to be Karuk.",
      "_id": {
        "$oid": "636a0d3ffb39baed9a5e7360"
      }
    },
    {
      "commenterId": "636917338a1cfe09ed6567d1",
      "text": "“This is all I have to keep my spirit going,” Reed said.",
      "_id": {
        "$oid": "636a0de6fb39baed9a5e757c"
      }
    },
    {
      "commenterId": "63691aac23590aa10d659495",
      "text": "Scala said he made his decision despite having spoken in the past with tribal members about their worries.",
      "_id": {
        "$oid": "636a0f3ffb39baed9a5e7beb"
      }
    },
    {
      "commenterId": "63691b4923590aa10d6594c3",
      "text": "The boys can’t learn how to fish from their fathers. The tribal elders who come for the ceremonies may not get to know the young men tasked with bringing them gifts of salmon that the boys haul up the canyon from the river.",
      "_id": {
        "$oid": "636a0fe3fb39baed9a5e7f5d"
      }
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1666338494863"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1666340068553"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "636a0a83fb39baed9a5e710a"
  },
  "posterId": "636918294c13a7994c9c5a8c",
  "message": "\"At more than 100,000 yen the iPhone 14 is too expensive and I just can't afford it. It would be fine if the battery lasted for 10 years,\" he said. The iPhone SE 2, released in 2020 but without the dual rear camera of the iPhone 14, was a \"good balance\" of cost and features, he said.",
  "image": "http://localhost:4200/images/AA13QDmI.jpg1667893891583.jpg",
  "likes": 7,
  "usersLiked": [
    "63690defcc71c4d8feffc569",
    "63690e1fcc71c4d8feffc571",
    "636917338a1cfe09ed6567d1",
    "6369191216483a418bc47418",
    "63691aac23590aa10d659495",
    "63691afe23590aa10d6594ac",
    "63691bd123590aa10d6594da"
  ],
  "comments": [
    {
      "commenterId": "63690defcc71c4d8feffc569",
      "text": "Sales of used smartphones grew nearly 15% in Japan to a record 2.1 million in the last financial year and are likely to reach 3.4 million by 2026, according to technology market research firm MM Research Institute.",
      "_id": {
        "$oid": "636a0c75fb39baed9a5e71de"
      }
    },
    {
      "commenterId": "63690e1fcc71c4d8feffc571",
      "text": "With Japan open again to foreign tourists, the secondhand iPhone market is getting another boost.",
      "_id": {
        "$oid": "636a0d32fb39baed9a5e7344"
      }
    },
    {
      "commenterId": "636917338a1cfe09ed6567d1",
      "text": "Retail chain Iosys Co Ltd has seen a surge in foreign tourists buying used iPhones in the last two months.",
      "_id": {
        "$oid": "636a0dd5fb39baed9a5e74ed"
      }
    },
    {
      "commenterId": "6369191216483a418bc47418",
      "text": "\"The yen just keeps weakening,\" said Iosys executive Takashi Okuno. \"That trend of visiting Japan and buying an iPhone is coming back.\"",
      "_id": {
        "$oid": "636a0edafb39baed9a5e7948"
      }
    },
    {
      "commenterId": "63691aac23590aa10d659495",
      "text": "In July, Apple hiked the price of the entry-level iPhone 13 by nearly a fifth. The basic iPhone 14 later debuted at 20% more than the iPhone 13 did, even as the U.S. price stayed flat at $799. ",
      "_id": {
        "$oid": "636a0f35fb39baed9a5e7bb7"
      }
    },
    {
      "commenterId": "63691afe23590aa10d6594ac",
      "text": "At more than 100,000 yen the iPhone 14 is too expensive and I just can't afford it.",
      "_id": {
        "$oid": "636a0f88fb39baed9a5e7d92"
      }
    },
    {
      "commenterId": "63691bd123590aa10d6594da",
      "text": "For years Japanese shoppers eagerly shelled out for the latest gadgets, but now a tumbling yen has put new iPhones out of reach for some and sparked a growing secondhand trade in a major market for Apple Inc.",
      "_id": {
        "$oid": "636a1057fb39baed9a5e824d"
      }
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1666857091584"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1666858675768"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "636a0af3fb39baed9a5e712b"
  },
  "posterId": "636917338a1cfe09ed6567d1",
  "message": "The departments of Treasury and State announced the sanctions Monday that target associates of Farhad Hoomer, a jailed leader and founder of an ISIS cell based in the South African city of Durban.\r\n\r\nHoomer -- who was arrested by South Africa in 2018 in connection to the deployment of improvised incendiary devices near a mosque and retail buildings -- was designated by the United States in March along with three others accused of aiding the growth of ISIS across Africa by facilitating the transfer of funds from the top of the terrorist organization's hierarchy to its branches on the continent.",
  "image": "http://localhost:4200/images/AA13RbK0.jpg1667894003357.jpg",
  "likes": 3,
  "usersLiked": [
    "63690defcc71c4d8feffc569",
    "636917338a1cfe09ed6567d1",
    "63691aac23590aa10d659495"
  ],
  "comments": [
    {
      "commenterId": "63690defcc71c4d8feffc569",
      "text": "Brian Nelson, under secretary of the Treasury for Terrorism and Financial Intelligence, said those blacklisted Monday are \"key individuals in ISIS' network in South Africa\" who have \"played pivotal roles in enabling terrorism and other criminal activities in the region.\"",
      "_id": {
        "$oid": "636a0c62fb39baed9a5e71cc"
      }
    },
    {
      "commenterId": "63690e1fcc71c4d8feffc571",
      "text": "\"The United States ... will continue to partner with South Africa to deny ISIS the ability to exploit the country's economy to raise and move funds to support the growth of ISIS affiliates and networks,\" he said in a statement.",
      "_id": {
        "$oid": "636a0d28fb39baed9a5e7311"
      }
    },
    {
      "commenterId": "636917338a1cfe09ed6567d1",
      "text": "Another four companies in the country were hit for being either owned, controlled or directed by Hoomer, the Treasury said.",
      "_id": {
        "$oid": "636a0dc9fb39baed9a5e74ca"
      }
    },
    {
      "commenterId": "636918294c13a7994c9c5a8c",
      "text": "The move comes a week after the Biden administration sanctioned eight people in the United States' first designations targeting ISIS in Somalia.",
      "_id": {
        "$oid": "636a0e6dfb39baed9a5e77c8"
      }
    },
    {
      "commenterId": "63691aac23590aa10d659495",
      "text": "U.S. officials have said that ISIS has been attempting to expand its influence in Africa through large-scale operations in locations with limited government control.",
      "_id": {
        "$oid": "636a0f17fb39baed9a5e7aea"
      }
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1667634803358"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1667635889667"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "636a0b5afb39baed9a5e714c"
  },
  "posterId": "63690e1fcc71c4d8feffc571",
  "message": "Lula’s margin of victory was less than two percentage points, the closest presidential outcome in Brazil’s modern history. (In 2002, Lula won by 22.5 percent and by 20.6 percent in 2006.) Half this increasingly polarized country considers him a criminal and/or a dangerous leftist ideologue who will transform Brazil into crisis-plagued Venezuela.",
  "image": "http://localhost:4200/images/AA13Pmg5.jpg1667894106897.jpg",
  "likes": 7,
  "usersLiked": [
    "63690defcc71c4d8feffc569",
    "636918294c13a7994c9c5a8c",
    "6369191216483a418bc47418",
    "63691afe23590aa10d6594ac",
    "63691b4923590aa10d6594c3",
    "63691bd123590aa10d6594da",
    "63691c653e87752578a6aec0"
  ],
  "comments": [
    {
      "commenterId": "63690defcc71c4d8feffc569",
      "text": "Brazil's 2022 presidential election has been highly politicized, to put it mildly. Both sides argued that democracy would be threatened if the opposing candidate won. A violent outcome was widely predicted.",
      "_id": {
        "$oid": "636a0c58fb39baed9a5e71ac"
      }
    },
    {
      "commenterId": "63690e1fcc71c4d8feffc571",
      "text": "Brazil Election 2022: Lula Wins Very Tight Presidential Runoff Election",
      "_id": {
        "$oid": "636a0d15fb39baed9a5e72f7"
      }
    },
    {
      "commenterId": "636918294c13a7994c9c5a8c",
      "text": "Bill Maher Doesn't See A Place For Monarchy In 'This Woke World'",
      "_id": {
        "$oid": "636a0e5bfb39baed9a5e7779"
      }
    },
    {
      "commenterId": "6369191216483a418bc47418",
      "text": "Lula will also have to work with a much more hostile congress. Bolsonaro’s Liberal Party now holds the largest number of seats in both houses, and it has plenty of right-wing allies to partner with in opposition.",
      "_id": {
        "$oid": "636a0ecefb39baed9a5e78c8"
      }
    },
    {
      "commenterId": "63691afe23590aa10d6594ac",
      "text": "One thing is clear: Lula will lead a different country than the one he governed a generation ago, and he’ll need to rely on a different set of political skills to keep his presidency above water.",
      "_id": {
        "$oid": "636a0f78fb39baed9a5e7d58"
      }
    },
    {
      "commenterId": "63691b4923590aa10d6594c3",
      "text": "According to a recent poll, some 75% of Bolsonaro's supporters say they have little or no confidence in their national voting system.",
      "_id": {
        "$oid": "636a0fd5fb39baed9a5e7ee9"
      }
    },
    {
      "commenterId": "63691bd123590aa10d6594da",
      "text": "Hundreds of thousands of Brazilians took to the streets after the October 31 runoff, alleging election fraud and urging the country's military to intervene to keep Bolsonaro in office. ",
      "_id": {
        "$oid": "636a103cfb39baed9a5e81cd"
      }
    },
    {
      "commenterId": "63691c653e87752578a6aec0",
      "text": "With a Republican sweep all but assured in tomorrow's U.S. midterm elections",
      "_id": {
        "$oid": "636a10a3fb39baed9a5e8413"
      }
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1667807706898"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1667809059158"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "636a0c2efb39baed9a5e718d"
  },
  "posterId": "63690defcc71c4d8feffc569",
  "message": "Other winners of the night included Luar's Raul Lopez for accessory designer; Elena Velez for emerging designer; Bode's Emily Bode Aujla for menswear designer; and Khaite's Catherine Holstein for womenswear designer.",
  "image": "http://localhost:4200/images/AA13R36O.jpg1667894318105.jpg",
  "likes": 8,
  "usersLiked": [
    "63690defcc71c4d8feffc569",
    "63690e1fcc71c4d8feffc571",
    "636917338a1cfe09ed6567d1",
    "636918294c13a7994c9c5a8c",
    "63691aac23590aa10d659495",
    "63691afe23590aa10d6594ac",
    "63691bd123590aa10d6594da",
    "63690abe829407acb79b3f53"
  ],
  "comments": [
    {
      "commenterId": "63690e1fcc71c4d8feffc571",
      "text": "'It was humiliating': Fashion's diversity problems still exist — how the industry can evolve",
      "_id": {
        "$oid": "636a0d0bfb39baed9a5e72de"
      }
    },
    {
      "commenterId": "636917338a1cfe09ed6567d1",
      "text": "Virgil Abloh memorial draws A-list stars including Ye, Kim Kardashian, Rihanna, Drake",
      "_id": {
        "$oid": "636a0dbcfb39baed9a5e748a"
      }
    },
    {
      "commenterId": "636918294c13a7994c9c5a8c",
      "text": "It was humiliating': Fashion's diversity problems still exist — how the industry can evolve",
      "_id": {
        "$oid": "636a0e4cfb39baed9a5e7751"
      }
    },
    {
      "commenterId": "63691aac23590aa10d659495",
      "text": "This article originally appeared on USA TODAY: Lenny Kravitz talks fashion icon status, Kim Kardashian accepts honor at CFDA Awards (plus Cher!)",
      "_id": {
        "$oid": "636a0f0dfb39baed9a5e7a5d"
      }
    },
    {
      "commenterId": "63691afe23590aa10d6594ac",
      "text": "Zendaya stylist Law Roach says 'anything is possible'",
      "_id": {
        "$oid": "636a0f6cfb39baed9a5e7cee"
      }
    },
    {
      "commenterId": "63691bd123590aa10d6594da",
      "text": "\"Russian Doll\" actress Natasha Lyonne served as emcee for the festivities, garnering some uncertain laughs with jokes on voting and fashion's lack of diversity.",
      "_id": {
        "$oid": "636a102ffb39baed9a5e814f"
      }
    },
    {
      "commenterId": "63690abe829407acb79b3f53",
      "text": "Seen and heard at New York Fashion Week: Get an inside look at excitement of NYFW shows",
      "_id": {
        "$oid": "636a10f5fb39baed9a5e85eb"
      }
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1667894318106"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1667918536612"
    }
  },
  "__v": 0
}]